app/controllers/cheats_controller.rb

SELECT * FROM "cheats"
---
  def index
    @cheats = Cheat.all

SELECT * FROM "cheats" WHERE ("cheats"."id" = 1)
---
  def show
    @cheat = Cheat.find(params[:id])

SELECT * FROM "cheats" WHERE ("cheats"."id" = 1)
---
  def edit
    @cheat = Cheat.find(params[:id])

INSERT INTO "cheats" ("language_id", "content", "created_at", "updated_at") VALUES(0, 'array indexing: 1-based
---
  def create
    @cheat = Cheat.new(params[:cheat])

    respond_to do |format|
      if @cheat.save

SELECT * FROM "cheats" WHERE ("cheats"."id" = 1)
UPDATE "cheats" SET "content" = '<p>array indexing: 1-based
---
  def update
    @cheat = Cheat.find(params[:id])

    respond_to do |format|
      if @cheat.update_attributes(params[:cheat])